tap "homebrew/bundle"
tap "jetbrains/utils"
tap "supabase/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Command-line interface for SQLite
brew "sqlite"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go Language's command-line interface for database migrations
brew "goose"
# Environment diagnostics for Kotlin Multiplatform Mobile app development
brew "kdoctor"
# Intelligent Kotlin support for any editor/IDE using the Language Server Protocol
brew "kotlin-language-server"
# Kotlin code formatter
brew "ktfmt"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# GDI+-compatible API on non-Windows operating systems
brew "mono-libgdiplus"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Vi 'workalike' with many additional features
brew "vim"
# Low level tooling for WebAssembly in Rust
brew "wasm-tools"
# UNIX shell (command interpreter)
brew "zsh"
# Official Language Server Protocol for the Kotlin language
brew "jetbrains/utils/kotlin-lsp"
# Supabase CLI
brew "supabase/tap/supabase"
# Toolset to implement parts of Android apps in native code
cask "android-ndk"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Command-line shell and scripting language
cask "powershell"
